refined_pisoFoam_snappyPipe/Allrun-parallel
./Allclean

#!/bin/sh
cd "${0%/*}" || exit 1                               # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions

runApplication blockMesh

#decomposing in parallel
runApplication decomposePar

runParallel snappyHexMesh -overwrite
restore0Dir -processor

runParallel topoSet
runParallel createPatch -overwrite
runParallel checkMesh
runParallel patchSummary

touch refined_snappy_pipe.foam



runParallel pisoFoam
runApplication reconstructPar
#reconstruction complete :) means i can view results...
